app/controllers/posts_controller.rb

  def index
    @new_post = Post.new
    @all_posts = Post.order(created_at: :desc).all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    @new_post = Post.new(post_params)

    if @new_post.save
---
INSERT INTO "posts" ("comment", "created_at", "updated_at") VALUES (?, ?, ?)  [["comment", "hello"], ["created_at", "2022-03-26 06:14:39.499377"], ["updated_at", "2022-03-26 06:14:39.499377"]]